<!-- terraform-plan-aws_general-purpose-pr-13 -->
## 📝 Terraform Plan for `aws/general-purpose` (PR #13)

<details>
<summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudfront_distribution.personal_website will be created
  + resource "aws_cloudfront_distribution" "personal_website" {
      + aliases                         = [
          + "reon.my.id",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = true
      + last_modified_time              = (known after apply)
      + logging_v1_enabled              = (known after apply)
      + price_class                     = "PriceClass_200"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags                            = {
          + "Name" = "personal-website-cloudfront"
        }
      + tags_all                        = {
          + "Name" = "personal-website-cloudfront"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + custom_error_response {
          + error_code         = 400
          + response_code      = 400
          + response_page_path = "/error.html"
        }
      + custom_error_response {
          + error_code         = 403
          + response_code      = 403
          + response_page_path = "/error.html"
        }
      + custom_error_response {
          + error_code         = 404
          + response_code      = 404
          + response_page_path = "/error.html"
        }
      + custom_error_response {
          + error_code         = 405
          + response_code      = 405
          + response_page_path = "/error.html"
        }
      + custom_error_response {
          + error_code         = 414
          + response_code      = 414
          + response_page_path = "/error.html"
        }
      + custom_error_response {
          + error_code         = 416
          + response_code      = 416
          + response_page_path = "/error.html"
        }
      + custom_error_response {
          + error_code         = 500
          + response_code      = 500
          + response_page_path = "/error.html"
        }
      + custom_error_response {
          + error_code         = 501
          + response_code      = 501
          + response_page_path = "/error.html"
        }
      + custom_error_response {
          + error_code         = 502
          + response_code      = 502
          + response_page_path = "/error.html"
        }
      + custom_error_response {
          + error_code         = 503
          + response_code      = 503
          + response_page_path = "/error.html"
        }
      + custom_error_response {
          + error_code         = 504
          + response_code      = 504
          + response_page_path = "/error.html"
        }

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 3600
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = "S3-personal-website"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }

          + grpc_config (known after apply)
        }

      + origin {
          + connection_attempts         = 3
          + connection_timeout          = 10
          + domain_name                 = (known after apply)
          + origin_access_control_id    = (known after apply)
          + origin_id                   = "S3-personal-website"
          + response_completion_timeout = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + cloudfront_default_certificate = true
          + minimum_protocol_version       = "TLSv1"
        }
    }

  # aws_cloudfront_origin_access_control.personal_website will be created
  + resource "aws_cloudfront_origin_access_control" "personal_website" {
      + arn                               = (known after apply)
      + description                       = "OAC for personal website S3 bucket"
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + name                              = "personal-website-oac"
      + origin_access_control_origin_type = "s3"
      + signing_behavior                  = "always"
      + signing_protocol                  = "sigv4"
    }

  # aws_s3_bucket.personal_website will be created
  + resource "aws_s3_bucket" "personal_website" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "personal-website-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-northeast-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "personal-website-bucket"
        }
      + tags_all                    = {
          + "Name" = "personal-website-bucket"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_policy.personal_website will be created
  + resource "aws_s3_bucket_policy" "personal_website" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
      + region = "ap-northeast-1"
    }

  # aws_s3_bucket_public_access_block.personal_website will be created
  + resource "aws_s3_bucket_public_access_block" "personal_website" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + region                  = "ap-northeast-1"
      + restrict_public_buckets = true
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ current_aws_caller_identity        = {
      ~ arn_without_session = "arn:aws:sts::319844025384:assumed-role/CITerraformProvisionsRole/GitHubActions-19757177761" -> "arn:aws:sts::319844025384:assumed-role/CITerraformProvisionsRole/GitHubActions-21003713436"
        # (1 unchanged attribute hidden)
    }
  + personal_website_bucket_name       = (known after apply)
  + personal_website_cloudfront_domain = (known after apply)
```

</details>

*Workflow run: [`21003713436`](https://github.com/reverseon/ishiori-on-cloud/actions/runs/21003713436)*
